



Network Working Group                                     P. Psenak, Ed.
Internet-Draft                                             K. Talaulikar
Intended status: Standards Track                     Cisco Systems, Inc.
Expires: August 20, 2018                                        S. Hegde
                                                  Juniper Networks, Inc.
                                                                A. Gulko
                                                         Thomson Reuters
                                                       February 16, 2018


                OSPF Segment Routing Flexible Algorithm
                 draft-ppsenak-ospf-sr-flex-algo-00.txt

Abstract

   IGP protocols traditionally compute best paths over the network based
   on the IGP metric assigned to the links.  Many network deployments
   use RSVP-TE based or Segment Routing based Traffic Engineering to
   enforce traffic over a path that is computed using different metrics
   or constraints than the shortest IGP path.  Various mechanisms are
   used to steer the traffic towards such traffic engineered paths.
   This document proposes a solution that allows IGPs themselves to
   compute constraint based paths over the network without the use of
   the above mentioned traffic engineering technologies.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on August 20, 2018.

Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.





Psenak, et al.           Expires August 20, 2018                [Page 1]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
     1.1.  Requirements notation . . . . . . . . . . . . . . . . . .   3
   2.  Flexible Algorithm  . . . . . . . . . . . . . . . . . . . . .   3
   3.  Flexible Algorithm Advertisement  . . . . . . . . . . . . . .   3
   4.  Flexible Algorithm Definition Advertisement . . . . . . . . .   4
     4.1.  Flexible Algorithm Definition TLV . . . . . . . . . . . .   4
     4.2.  Flexible Algorithm Exclude Admin Group Sub-TLV  . . . . .   7
     4.3.  Flexible Algorithm Include Admin Group Sub-TLVs . . . . .   7
   5.  Calculation of Flexible Algorithm Paths . . . . . . . . . . .   8
   6.  Backward Compatibility  . . . . . . . . . . . . . . . . . . .  10
   7.  Security Considerations . . . . . . . . . . . . . . . . . . .  10
   8.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  10
     8.1.  OSPF Router Information (RI) TLVs Registry  . . . . . . .  10
     8.2.  OSPF Flexible Algorithm Definition TLV Sub-TLV Registry .  10
     8.3.  OSPF Flexible Algorithm Definition TLV Metric Registry  .  11
   9.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .  11
   10. References  . . . . . . . . . . . . . . . . . . . . . . . . .  11
     10.1.  Normative References . . . . . . . . . . . . . . . . . .  11
     10.2.  Informative References . . . . . . . . . . . . . . . . .  12
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  12

1.  Introduction

   IGP computed path based on the shortest IGP metric must often be
   replaced by traffic engineered path due to the traffic requirements
   which are not reflected in the IGP metric.  Some networks engineer
   the IGP metric assignments in a way that the IGP Metric reflects the
   link bandwidth or delay.  If, for example, the IGP metric is
   reflecting the bandwidth on the link and the application traffic is
   delay sensitive, the best IGP path may not reflect the best path from
   such application's perspective.

   To overcome such IGP limitation, various sorts of traffic engineering
   has been deployed, including RSVP-TE or SR-TE, in which case the TE
   component is responsible for computing the path based on additional
   metrics and/or constraints.  Such paths need to be installed in the



Psenak, et al.           Expires August 20, 2018                [Page 2]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


   forwarding and replace the original paths computed by IGPs.  Tunnels
   are often used to represent the engineered paths and mechanisms like
   one described in [RFC3906] are used to replace the native IGP paths
   with such tunnel paths.

   Segment Routing (SR) allows a flexible definition of end-to-end paths
   within IGP topologies by encoding paths as sequences of topological
   sub-paths, called segments.  It also defines an algorithm that
   defines how the paths are computed.  It also provides a way to
   associate Prefix-SID with an algorithm.  This allows IGPs to compute
   paths based on various algorithms and cause traffic to be forwarded
   on such paths using the algorithm specific segments.

   This document describes the OSPFv2 and OSPFv3 extension to support
   Segment Routing Flexible Algorithm on an MPLS data-plane.

1.1.  Requirements notation

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

2.  Flexible Algorithm

   Many possible constraints may be used to compute a path over a
   network.  Some networks are deployed as multiple planes.  A simple
   form of constraint may be to use a particular plane.  A more
   sophisticated form of constraint can include some extended metric as
   described in [RFC7471].  Constraints which restrict paths to links
   with specific affinities or avoid links with specific affinities are
   also possible.  Combinations of these are also possible.

   To provide maximum flexibility we do not want to provide a strict
   mapping between the set of constraints and the algorithm that is
   associated with it.  We want the mapping between the algorithm value
   and it's meaning to be flexible and defined by the user.  As far as
   all routers in the domain have the common understanding what the
   particular algorithm value represents, the computation for such
   algorithm is consistent and traffic is not subject to any looping.

   Because the meaning of the algorithm is not defined by any standard,
   but is defined by the user, we call it Flex-Algorithm.

3.  Flexible Algorithm Advertisement

   [I-D.ietf-ospf-segment-routing-extensions] and
   [I-D.ietf-ospf-ospfv3-segment-routing-extensions] define an SR-
   Algorithm.  This algorithm defines how the best path is computed by



Psenak, et al.           Expires August 20, 2018                [Page 3]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


   the IGP.  Routers advertise the support for the algorithm as a node
   capability.  Prefix SIDs are also advertised with an algorithm value
   and as such are tightly coupled with the algorithm.

   Existing advertisement of the SR-Algorithm is used for the Flex-
   Algorithm advertisements as defined in
   [I-D.ietf-ospf-segment-routing-extensions].

   SR-Algorithm is a one octet value.
   [I-D.hegdeppsenak-isis-sr-flex-algo] defines the values used for
   Flex-Algorithms.

4.  Flexible Algorithm Definition Advertisement

   To guarantee the loop free forwarding for paths computed for a
   particular Flex-Algorithm, all routers in the flooding scope of the
   algorithm definition MUST agree on the definition of the Flex-
   Algorithm.

4.1.  Flexible Algorithm Definition TLV

   Flexible Algorithm Definition TLV (FAD TLV) is used to advertise the
   definition of the Flex-Algorithm.

   FAD TLV is advertised as a top-level TLV of the RI LSA that is
   defined in [RFC7770].

   When the definition of the Flex Algorithm is advertised, it is
   applicable to all topologies supported on the receiving node.

   FAD TLV has the following format:


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |              Type             |             Length            |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |    Algorithm  |   Metric Type |   Alg. Type   |    Priority   |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                            Sub-TLVs                           |
     +                                                               +
     |                               ...                             |

     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   where:



Psenak, et al.           Expires August 20, 2018                [Page 4]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


      Type: TBD1

      Length: variable, dependent on the included Sub-TLVs

      Algorithm: Flex-Algorithm number.  Value between 128 and 255
      inclusive.

      Metric Type: Type of metric to be used during the calculation.
      Following values are defined:

         0: IGP Metric

         1: Min Unidirectional Link Delay as defined in [RFC7471].

         2: TE default metric as defined in [RFC3630].

      Algorithm Type: Single octet identifying the algorithm type used
      to compute paths for the Flex-Algoritm.  Values are defined in
      "IGP Algorithm Types" registry defined under "Interior Gateway
      Protocol (IGP) Parameters" IANA registries.

      Priority: Single octet that specifies the priority of the
      advertisement.

      Sub-TLVs - optional sub-TLVs.

   When the router is configured with the local definition of the Flex-
   Algorithm, the router MUST advertise its local definition in the FAD
   Sub-TLV.  If the local definition of the Flex-Algorithm is not
   advertised, the inconsistency in the configuration of the Flex-
   Algorithm on various nodes cannot be detected and traffic routed
   based on a Flex-Algorithm path may loop permanently.

   Every router, that is configured to support a particular Flex-
   Algorithm, MUST select the Flex-Algorithm definition based on the
   following rules:

      From the received advertisements of the FAD, select the one(s)
      with the highest priority.

      If there are multiple advertisements of the FAD with the same
      highest priority, select the one that is originated from the
      router with the highest OSPF Router ID.

      If the router has a local definition of the Flex-Algorithm,
      compare it with the received FAD advertisements using the same
      rules as have been used to pick the best FAD advertisement, e.g.,
      priority and OSPF Router ID.



Psenak, et al.           Expires August 20, 2018                [Page 5]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


   A router that is not configured to support a particular Flex-
   Algorithm MUST ignore FAD Sub-TLVs advertisements for such Flex-
   Algorithm.

   Having a deterministic way that always produces a valid Flex-
   Algorithm definition avoids conflicts and maximizes the availability
   of the forwarding for the traffic that is using the Flex-Algorithm
   paths.

   Any change in the Flex-Algorithm definition may result in temporary
   disruption of traffic that is forwarded based on such Flex-Algorithm
   paths.  The impact is similar to any other event that requires
   network wide convergence

   When multiple FAD TLVs, for the same Flexible-Algorithm, are received
   from a given router, the receiver MUST use the first occurrence of
   the TLV in the Router Information LSA.  If the FAD TLV, for the same
   Flex-Algorithm, appears in multiple Router Information LSAs that have
   different flooding scopes, the FAD TLV in the Router Information LSA
   with the area-scoped flooding scope MUST be used.  If the FAD TLV,
   for the same algorithm, appears in multiple Router Information LSAs
   that have the same flooding scope, the FAD TLV in the Router
   Information (RI) LSA with the numerically smallest Instance ID MUST
   be used and subsequent instances of the FAD TLV MUST be ignored.

   The RI LSA can be advertised at any of the defined opaque flooding
   scopes (link, area, or Autonomous System (AS)).  For the purpose of
   FAD TLV advertisement, area-scoped flooding is REQUIRED.  The
   Autonomous System flooding scope SHOULD not be used by default unless
   local configuration policy on the originating router indicates domain
   wide flooding.

   Flex-Algorithm definition is topology independent.  A node which
   advertises support for a given Flex-Algorithm may support that Flex-
   Algorithm on any subset of the topologies it supports.  Enabling of a
   supported Flex-Algorithm on a given topology is a matter of local
   configuration.  For a given topology, if out of the set of nodes
   supporting that topology AND advertising support for a given Flex-
   Algorithm only a subset of the nodes actually compute/install Flex-
   Algorithm specific paths in the forwarding plane for that topology,
   some traffic intended for such topology/Flex-Algorithm could be
   dropped if forwarded to a node on which the Flex-Algorithm is not
   enabled on that topology.








Psenak, et al.           Expires August 20, 2018                [Page 6]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


4.2.  Flexible Algorithm Exclude Admin Group Sub-TLV

   The Flexible-Algorithm definition can specify 'colors' that are used
   by the operator to exclude links during the Flex-Algorithm path
   computation.

   Flexible Algorithm Exclude Admin Group Sub-TLV (FAEAG Sub-TLV) is a
   Sub-TLV of the FAD TLV.  It has the following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Extended Admin Group                     |
   +-                                                             -+
   |                            ...                                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   where:

      Type: 1

      Length: variable, dependent on the size of the Extended Admin
      Group.  MUST be a multiple of 4 octets.

      Extended Administrative Group: Extended Administrative Group as
      defined in [RFC7308].

   FAEAG Sub-TLV SHOULD only appear once in FAD TLV.  If it appears more
   then once, FAD TLV MUST be ignored by the receiver.

4.3.  Flexible Algorithm Include Admin Group Sub-TLVs

   The Flexible-Algorithm definition can specify 'colors' that are used
   by the operator to include links during the Flex-Algorithm path
   computation.

   The format of the include Sub-TLVs is identical to the format of the
   FAEAG Sub-TLV in Section 4.2.

   Two forms of inclusion are available - include-any and include-all.

      Flexible Algorithm Include-Any Admin Group Sub-TLV - Type 2.

      Flexible Algorithm Include-All Admin Group Sub-TLV - Type 3.






Psenak, et al.           Expires August 20, 2018                [Page 7]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


   Flexible Algorithm Include Admin Group Sub-TLVs SHOULD only appear
   once in FAD Sub-TLV.  If any of these Sub-TLVs appear more then once,
   FAD Sub-TLV MUST be ignored by the receiver.

5.  Calculation of Flexible Algorithm Paths

   A router may compute path for multiple Flex-Algorithms.

   A router MUST be configured to support Flex-Algorithm K before it can
   compute any path for Flex-Algorithm K.

   A router MUST either be configured with a local definition of Flex-
   Algorithm K or receive the definition via the FAD TLV, as described
   in Section 4.1, before it can compute any path for Flex-Algorithm K.

   When computing the path for Flex-Algorithm K, all nodes that do not
   advertise support for Flex-Algorithm K in SR-Algorithm Sub-TLV
   ([I-D.ietf-ospf-segment-routing-extensions]), MUST be pruned from the
   topology.

   When computing the path for Flex-Algorithm K, the metric that is part
   of the Flex-Algorithm definition (Section 4.1) MUST be used.

   Various link include or exclude rules can be part of the Flex-
   Algorithm definition.  These rules use Extended Administrative Groups
   (EAG) as defined in [RFC7308].  [RFC7308] uses term 'colors' as a
   shorthand to refer to particular bits with an EAG.  Link
   advertisement CAN also include EAG, which describe which color is set
   on the link.

   Link advertisement CAN also include Administrative Group (AG) TLV
   ([RFC3630]).  The coexistence of EAG and AG is described in the
   section 2.3.1 of [RFC7308].

   Rules, in the order as specified below, MUST be used to prune link
   from the topology during the Flex-Algorithm computation.

   For all links in the topology:

      1.  Check if any exclude rule is part of the Flex-Algorithm
      definition.  If such exclude rule exists, check if any color that
      is part of the exclude rule is also set on the link.  If such a
      color exist, the link MUST be pruned from the computation.

      2.  Check if any include-any rule is part of the Flex-Algorithm
      definition. if such include-any rule exists, check if any color
      that is part of the include-any rule is also set on the link.  If




Psenak, et al.           Expires August 20, 2018                [Page 8]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


      such color does not exist, the link MUST be pruned from the
      computation.

      3.  Check if any include-all rule is part of the Flex-Algorithm
      definition.  If such include-all rule exists, check if all colors
      that are part of the include-all rule are also set on the link.
      If not all such colors are set on the link, the link MUST be
      pruned from the computation.

      4.  If the Flex-Algorithm definition uses other than IGP metric
      (Section 4.1), and such metric is not advertised for the
      particular link in a topology for which the computation is done,
      such link MUST be pruned from the computation.  A metric of value
      0 MUST NOT be assumed in such case.

   Flex-Algorithm K path MUST be installed in the MPLS forwarding plane
   using the MPLS label that corresponds to the Prefix-SID that was
   advertised for algorithm K.  If the Prefix SID for algorithm K is not
   known, the Flex-Algorithm K path to such prefix MUST NOT be installed
   in the MPLS forwarding plane.

   Loop Free Alternate (LFA) paths for Flex-Algorithm K path MUST be
   computed using the same constraints as the calculation of the primary
   paths for Flex-Algorithm K.  LFA path MUST only use Prefix-SIDs
   advertised specifically for algorithm K to enforce the traffic over
   such path.  LFA path MUST NOT use Adjacency-SID that belong to the
   link that has been pruned from the computation.

   If LFA protection is being used to protect Flex-Algorithm K paths,
   all routers in the area SHOULD advertise at least one Flex-Algorithm
   K specific Prefix-SID.  These Prefix-SIDs are used to enforce traffic
   over the LFA computed backup path.

   Flex-Algorithm paths MAY be used by other applications, that do not
   utilize MPLS forwarding plane.  It is outside of the sope of this
   specification, how these application learn and use the Flex-Algorithm
   specific paths.

   Any Shortest Path Tree calculation is limited to a single area.  Same
   applies to Flex-Algorithm calculations.  Given that the computing
   router may not have the visibility to the topology of remote areas,
   the Flex-Algorithm K path to an inter-area prefix will only be
   computed for the local area.  The egress Area-Border-Router (ABR)
   router will be selected based on the best path for the Flex-Algorithm
   K in the local area and such ABR router will be responsible to
   compute the best Flex-Algorithm K path over the next area.  This may
   produce end-to-end path, which is not the best from the Flex-
   Algorithm K perspective.  If the best end-to-end path for Flex-



Psenak, et al.           Expires August 20, 2018                [Page 9]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


   Algorithm K needs to be used for inter-area destinations, paths for
   such destinations need to be computed by the entity that has the
   topological information about all areas.

6.  Backward Compatibility

   This extension brings no new backward compatibility issues.

7.  Security Considerations

   This extension adds no new security considerations.

8.  IANA Considerations

8.1.  OSPF Router Information (RI) TLVs Registry

   This specification updates the OSPF Router Information (RI) TLVs
   Registry with the following value:

   o TBD3 (Suggested value 16) - Flexible Algorithm Definition TLV

8.2.  OSPF Flexible Algorithm Definition TLV Sub-TLV Registry

   The "OSPF Flexible Algorithm Definition TLV sub-TLV" registry will
   define sub-TLVs at any level of nesting for Flexible Algorithm TLVs
   and should be added to the "Open Shortest Path First (OSPF)
   Parameters" registries group.  New values can be allocated via IETF
   Review or IESG Approval.

   The following initial values are allocated:

   o  0 - Reserved

   o  1 - Flexible Algorithm Exclude Admin Group Sub-TLV

   o  1 - Flexible Algorithm Include-Any Admin Group Sub-TLV

   o  1 - Flexible Algorithm Exclude-All Group Sub-TLV

   Types in the range 32768-33023 are for experimental use; these will
   not be registered with IANA, and MUST NOT be mentioned by RFCs.

   Types in the range 33024-65535 are not to be assigned at this time.
   Before any assignments can be made in the 33024-65535 range, there
   MUST be an IETF specification that specifies IANA Considerations that
   covers the range being assigned.





Psenak, et al.           Expires August 20, 2018               [Page 10]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


8.3.  OSPF Flexible Algorithm Definition TLV Metric Registry

   The "OSPF Flexible Algorithm Definition TLV Metric Registry" registry
   will define the metric type (Section 4.1).

   The following initial values are allocated:

   o  0 - IGP Metric

   o  1 - Min Unidirectional Link Delay [RFC7471]

   o  2 - TE Default Metric [RFC3630]

   The registry should be added to the "Open Shortest Path First (OSPF)
   Parameters" registries group.  New values can be allocated via IETF
   Review or IESG Approval.

9.  Acknowledgments

10.  References

10.1.  Normative References

   [I-D.hegdeppsenak-isis-sr-flex-algo]
              Psenak, P., Hegde, S., Filsfils, C., and A. Gulko, "ISIS
              Segment Routing Flexible Algorithm", draft-hegdeppsenak-
              isis-sr-flex-algo-01 (work in progress), October 2017.

   [I-D.ietf-ospf-ospfv3-segment-routing-extensions]
              Psenak, P., Filsfils, C., Previdi, S., Gredler, H.,
              Shakir, R., Henderickx, W., and J. Tantsura, "OSPFv3
              Extensions for Segment Routing", draft-ietf-ospf-ospfv3-
              segment-routing-extensions-11 (work in progress), January
              2018.

   [I-D.ietf-ospf-segment-routing-extensions]
              Psenak, P., Previdi, S., Filsfils, C., Gredler, H.,
              Shakir, R., Henderickx, W., and J. Tantsura, "OSPF
              Extensions for Segment Routing", draft-ietf-ospf-segment-
              routing-extensions-24 (work in progress), December 2017.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.






Psenak, et al.           Expires August 20, 2018               [Page 11]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


   [RFC2328]  Moy, J., "OSPF Version 2", STD 54, RFC 2328,
              DOI 10.17487/RFC2328, April 1998,
              <https://www.rfc-editor.org/info/rfc2328>.

   [RFC3630]  Katz, D., Kompella, K., and D. Yeung, "Traffic Engineering
              (TE) Extensions to OSPF Version 2", RFC 3630,
              DOI 10.17487/RFC3630, September 2003,
              <https://www.rfc-editor.org/info/rfc3630>.

   [RFC5250]  Berger, L., Bryskin, I., Zinin, A., and R. Coltun, "The
              OSPF Opaque LSA Option", RFC 5250, DOI 10.17487/RFC5250,
              July 2008, <https://www.rfc-editor.org/info/rfc5250>.

   [RFC7308]  Osborne, E., "Extended Administrative Groups in MPLS
              Traffic Engineering (MPLS-TE)", RFC 7308,
              DOI 10.17487/RFC7308, July 2014,
              <https://www.rfc-editor.org/info/rfc7308>.

   [RFC7471]  Giacalone, S., Ward, D., Drake, J., Atlas, A., and S.
              Previdi, "OSPF Traffic Engineering (TE) Metric
              Extensions", RFC 7471, DOI 10.17487/RFC7471, March 2015,
              <https://www.rfc-editor.org/info/rfc7471>.

   [RFC7770]  Lindem, A., Ed., Shen, N., Vasseur, JP., Aggarwal, R., and
              S. Shaffer, "Extensions to OSPF for Advertising Optional
              Router Capabilities", RFC 7770, DOI 10.17487/RFC7770,
              February 2016, <https://www.rfc-editor.org/info/rfc7770>.

10.2.  Informative References

   [I-D.gulkohegde-routing-planes-using-sr]
              Hegde, S. and a. arkadiy.gulko@thomsonreuters.com,
              "Separating Routing Planes using Segment Routing", draft-
              gulkohegde-routing-planes-using-sr-00 (work in progress),
              March 2017.

   [RFC3906]  Shen, N. and H. Smit, "Calculating Interior Gateway
              Protocol (IGP) Routes Over Traffic Engineering Tunnels",
              RFC 3906, DOI 10.17487/RFC3906, October 2004,
              <https://www.rfc-editor.org/info/rfc3906>.

Authors' Addresses









Psenak, et al.           Expires August 20, 2018               [Page 12]

Internet-Draft     OSPF Segment Routing Flex Algorithm     February 2018


   Peter Psenak (editor)
   Cisco Systems, Inc.
   Eurovea Centre, Central 3
   Pribinova Street 10
   Bratislava  81109
   Slovakia

   Email: ppsenak@cisco.com


   Ketan Talaulikar
   Cisco Systems, Inc.
   S.No. 154/6, Phase I, Hinjawadi
   PUNE, MAHARASHTRA   411 057
   India

   Email: ketant@cisco.com


   Shraddha Hegde
   Juniper Networks, Inc.
   Embassy Business Park
   Bangalore, KA, 560093
   India

   Email: shraddha@juniper.net


   Arkadiy Gulko
   Thomson Reuters

   Email: arkadiy.gulko@thomsonreuters.com



















Psenak, et al.           Expires August 20, 2018               [Page 13]
